In [1]:
import os
import sys
import numpy as np
import pandas as pd
import csv

In [9]:
data_dir = "/mnt/c/Users/ruotong/Home/xERTE/tKGR/data/ml-1m"
print(os.listdir(data_dir))
df = pd.read_csv(os.path.join(data_dir, "ratings.dat"), sep="::",header=None, names=['user','movie','rating','timestamp'])
df = df.reindex(columns=['user','rating','movie','timestamp'])
df.head()

['movies.dat', 'ratings.dat', 'README', 'users.dat']

   user  rating  movie  timestamp
0     1       5   1193  978300760
1     1       3    661  978302109
2     1       3    914  978301968
3     1       4   3408  978300275
4     1       5   2355  978824291

In [44]:
df = df.sort_values(by=['timestamp'])
df.head()
split = [0.7, 0.15, 0.15]
rat_num = len(df)
train_data, val_data, test_data = df[:int(rat_num*split[0])],\
    df[int(rat_num*split[0]) : int(rat_num*(split[0]+split[1]))], \
    df[int(rat_num*(split[0]+split[1])) :]

In [45]:
train_data

         user  rating  movie  timestamp
1000138  6040       4    858  956703932
1000153  6040       4   2384  956703954
999873   6040       5    593  956703954
1000007  6040       4   1961  956703977
1000192  6040       5   2019  956703977
...       ...     ...    ...        ...
334424   1974       3    920  974862363
334541   1974       5   2692  974862363
188106   1167       4     11  974862369
187208   1162       3   1248  974862386
187210   1162       5   1252  974862386

[700146 rows x 4 columns]

In [46]:
val_data

        user  rating  movie  timestamp
187235  1162       3    919  974862386
187266  1162       4   3435  974862386
187367  1163       4    748  974862390
187370  1163       4   1604  974862390
187418  1163       3   1792  974862390
...      ...     ...    ...        ...
48463    326       3   3152  976422034
48535    326       4   2716  976422034
47451    319       3    144  976422042
47589    319       3   2759  976422042
47547    319       4   2671  976422042

[150031 rows x 4 columns]

In [47]:
test_data

        user  rating  movie   timestamp
48360    326       2   1263   976422054
48364    326       3   1193   976422054
48562    326       4   3471   976422083
323447  1917       4   1200   976422083
48473    326       4    953   976422083
...      ...     ...    ...         ...
825793  4958       1   2399  1046454338
825438  4958       5   1407  1046454443
825731  4958       3   2634  1046454548
825724  4958       4   3264  1046454548
825603  4958       4   1924  1046454590

[150032 rows x 4 columns]

In [49]:
df.to_csv('../data/ml-1m/ratings.txt', sep='\t', index=False, header=False)
train_data.to_csv('../data/ml-1m/train.txt', sep='\t', index=False, header=False)
val_data.to_csv('../data/ml-1m/valid.txt', sep='\t', index=False, header=False)
test_data.to_csv('../data/ml-1m/test.txt', sep='\t', index=False, header=False)